kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_ble_em_rx.h
#ifndef _REG_BLE_EM_RX_H_
#define _REG_BLE_EM_RX_H_

#include <stdint.h>

#include "_reg_ble_em_rx.h"
#include "arch.h"
#include "compiler.h"
#include "em_map_ble.h"
#include "reg_access.h"

#define REG_BLE_EM_RX_COUNT 5

#define REG_BLE_EM_RX_DECODING_MASK 0x0000000F

//#define REG_BLE_EM_RX_ADDR_GET(idx) (jump_table_struct[offset_em_rx] + (idx) *
//REG_BLE_EM_RX_SIZE)
#define REG_BLE_EM_RX_ADDR_GET(idx) \
  (jump_table_struct[offset_em_rx] + (idx)*REG_BLE_EM_RX_SIZE)

/**
 * @brief RXCNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     15               RXDONE   0
 *  13:00            RXNEXTPTR   0x0
 * </pre>
 */
//#define BLE_RXCNTL_ADDR   (0x50008000 + jump_table_struct[offset_em_rx])
#define BLE_RXCNTL_ADDR (0x80000 + jump_table_struct[offset_em_rx])
#define BLE_RXCNTL_INDEX 0x00000000
#define BLE_RXCNTL_RESET 0x00000000

__INLINE uint16_t ble_rxcntl_get(int elt_idx) {
  return EM_BLE_RD(BLE_RXCNTL_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);
}

__INLINE void ble_rxcntl_set(int elt_idx, uint16_t value) {
  EM_BLE_WR(BLE_RXCNTL_ADDR + elt_idx * REG_BLE_EM_RX_SIZE, value);
}

// field definitions
#define BLE_RXDONE_BIT ((uint16_t)0x00008000)
#define BLE_RXDONE_POS 15
#define BLE_RXNEXTPTR_MASK ((uint16_t)0x00003FFF)
#define BLE_RXNEXTPTR_LSB 0
#define BLE_RXNEXTPTR_WIDTH ((uint16_t)0x0000000E)

#define BLE_RXDONE_RST 0x0
#define BLE_RXNEXTPTR_RST 0x0

__INLINE void ble_rxcntl_pack(int elt_idx, uint8_t rxdone, uint16_t rxnextptr) {
  ASSERT_ERR((((uint16_t)rxdone << 15) & ~((uint16_t)0x00008000)) == 0);
  ASSERT_ERR((((uint16_t)rxnextptr << 0) & ~((uint16_t)0x00003FFF)) == 0);
  EM_BLE_WR(BLE_RXCNTL_ADDR + elt_idx * REG_BLE_EM_RX_SIZE,
            ((uint16_t)rxdone << 15) | ((uint16_t)rxnextptr << 0));
}

__INLINE void ble_rxcntl_unpack(int elt_idx, uint8_t* rxdone,
                                uint16_t* rxnextptr) {
  uint16_t localVal = EM_BLE_RD(BLE_RXCNTL_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);

  *rxdone = (localVal & ((uint16_t)0x00008000)) >> 15;
  *rxnextptr = (localVal & ((uint16_t)0x00003FFF)) >> 0;
}

__INLINE uint8_t ble_rxdone_getf(int elt_idx) {
  uint16_t localVal = EM_BLE_RD(BLE_RXCNTL_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);
  return ((localVal & ((uint16_t)0x00008000)) >> 15);
}

__INLINE void ble_rxdone_setf(int elt_idx, uint8_t rxdone) {
  ASSERT_ERR((((uint16_t)rxdone << 15) & ~((uint16_t)0x00008000)) == 0);
  EM_BLE_WR(BLE_RXCNTL_ADDR + elt_idx * REG_BLE_EM_RX_SIZE,
            (EM_BLE_RD(BLE_RXCNTL_ADDR + elt_idx * REG_BLE_EM_RX_SIZE) &
             ~((uint16_t)0x00008000)) |
                ((uint16_t)rxdone << 15));
}

__INLINE uint16_t ble_rxnextptr_getf(int elt_idx) {
  uint16_t localVal = EM_BLE_RD(BLE_RXCNTL_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);
  return ((localVal & ((uint16_t)0x00003FFF)) >> 0);
}

__INLINE void ble_rxnextptr_setf(int elt_idx, uint16_t rxnextptr) {
  ASSERT_ERR((((uint16_t)rxnextptr << 0) & ~((uint16_t)0x00003FFF)) == 0);
  EM_BLE_WR(BLE_RXCNTL_ADDR + elt_idx * REG_BLE_EM_RX_SIZE,
            (EM_BLE_RD(BLE_RXCNTL_ADDR + elt_idx * REG_BLE_EM_RX_SIZE) &
             ~((uint16_t)0x00003FFF)) |
                ((uint16_t)rxnextptr << 0));
}

/**
 * @brief RXSTAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     07         BDADDR_MATCH   0
 *     06             NESN_ERR   0
 *     05               SN_ERR   0
 *     04              MIC_ERR   0
 *     03              CRC_ERR   0
 *     02              LEN_ERR   0
 *     01             TYPE_ERR   0
 *     00             SYNC_ERR   0
 * </pre>
 */
//#define BLE_RXSTAT_ADDR   (0x50008002 + jump_table_struct[offset_em_rx])
#define BLE_RXSTAT_ADDR (0x80002 + jump_table_struct[offset_em_rx])
#define BLE_RXSTAT_INDEX 0x00000001
#define BLE_RXSTAT_RESET 0x00000000

__INLINE uint16_t ble_rxstat_get(int elt_idx) {
  return EM_BLE_RD(BLE_RXSTAT_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);
}

__INLINE void ble_rxstat_set(int elt_idx, uint16_t value) {
  EM_BLE_WR(BLE_RXSTAT_ADDR + elt_idx * REG_BLE_EM_RX_SIZE, value);
}

// field definitions
#define BLE_BDADDR_MATCH_BIT ((uint16_t)0x00000080)
#define BLE_BDADDR_MATCH_POS 7
#define BLE_NESN_ERR_BIT ((uint16_t)0x00000040)
#define BLE_NESN_ERR_POS 6
#define BLE_SN_ERR_BIT ((uint16_t)0x00000020)
#define BLE_SN_ERR_POS 5
#define BLE_MIC_ERR_BIT ((uint16_t)0x00000010)
#define BLE_MIC_ERR_POS 4
#define BLE_CRC_ERR_BIT ((uint16_t)0x00000008)
#define BLE_CRC_ERR_POS 3
#define BLE_LEN_ERR_BIT ((uint16_t)0x00000004)
#define BLE_LEN_ERR_POS 2
#define BLE_TYPE_ERR_BIT ((uint16_t)0x00000002)
#define BLE_TYPE_ERR_POS 1
#define BLE_SYNC_ERR_BIT ((uint16_t)0x00000001)
#define BLE_SYNC_ERR_POS 0

#define BLE_BDADDR_MATCH_RST 0x0
#define BLE_NESN_ERR_RST 0x0
#define BLE_SN_ERR_RST 0x0
#define BLE_MIC_ERR_RST 0x0
#define BLE_CRC_ERR_RST 0x0
#define BLE_LEN_ERR_RST 0x0
#define BLE_TYPE_ERR_RST 0x0
#define BLE_SYNC_ERR_RST 0x0

__INLINE void ble_rxstat_pack(int elt_idx, uint8_t bdaddrmatch, uint8_t nesnerr,
                              uint8_t snerr, uint8_t micerr, uint8_t crcerr,
                              uint8_t lenerr, uint8_t typeerr,
                              uint8_t syncerr) {
  ASSERT_ERR((((uint16_t)bdaddrmatch << 7) & ~((uint16_t)0x00000080)) == 0);
  ASSERT_ERR((((uint16_t)nesnerr << 6) & ~((uint16_t)0x00000040)) == 0);
  ASSERT_ERR((((uint16_t)snerr << 5) & ~((uint16_t)0x00000020)) == 0);
  ASSERT_ERR((((uint16_t)micerr << 4) & ~((uint16_t)0x00000010)) == 0);
  ASSERT_ERR((((uint16_t)crcerr << 3) & ~((uint16_t)0x00000008)) == 0);
  ASSERT_ERR((((uint16_t)lenerr << 2) & ~((uint16_t)0x00000004)) == 0);
  ASSERT_ERR((((uint16_t)typeerr << 1) & ~((uint16_t)0x00000002)) == 0);
  ASSERT_ERR((((uint16_t)syncerr << 0) & ~((uint16_t)0x00000001)) == 0);
  EM_BLE_WR(BLE_RXSTAT_ADDR + elt_idx * REG_BLE_EM_RX_SIZE,
            ((uint16_t)bdaddrmatch << 7) | ((uint16_t)nesnerr << 6) |
                ((uint16_t)snerr << 5) | ((uint16_t)micerr << 4) |
                ((uint16_t)crcerr << 3) | ((uint16_t)lenerr << 2) |
                ((uint16_t)typeerr << 1) | ((uint16_t)syncerr << 0));
}

