kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_ble_em_rx.h
__INLINE void ble_rxstat_unpack(int elt_idx, uint8_t* bdaddrmatch,
                                uint8_t* nesnerr, uint8_t* snerr,
                                uint8_t* micerr, uint8_t* crcerr,
                                uint8_t* lenerr, uint8_t* typeerr,
                                uint8_t* syncerr) {
  uint16_t localVal = EM_BLE_RD(BLE_RXSTAT_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);

  *bdaddrmatch = (localVal & ((uint16_t)0x00000080)) >> 7;
  *nesnerr = (localVal & ((uint16_t)0x00000040)) >> 6;
  *snerr = (localVal & ((uint16_t)0x00000020)) >> 5;
  *micerr = (localVal & ((uint16_t)0x00000010)) >> 4;
  *crcerr = (localVal & ((uint16_t)0x00000008)) >> 3;
  *lenerr = (localVal & ((uint16_t)0x00000004)) >> 2;
  *typeerr = (localVal & ((uint16_t)0x00000002)) >> 1;
  *syncerr = (localVal & ((uint16_t)0x00000001)) >> 0;
}

__INLINE uint8_t ble_bdaddr_match_getf(int elt_idx) {
  uint16_t localVal = EM_BLE_RD(BLE_RXSTAT_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);
  return ((localVal & ((uint16_t)0x00000080)) >> 7);
}

__INLINE void ble_bdaddr_match_setf(int elt_idx, uint8_t bdaddrmatch) {
  ASSERT_ERR((((uint16_t)bdaddrmatch << 7) & ~((uint16_t)0x00000080)) == 0);
  EM_BLE_WR(BLE_RXSTAT_ADDR + elt_idx * REG_BLE_EM_RX_SIZE,
            (EM_BLE_RD(BLE_RXSTAT_ADDR + elt_idx * REG_BLE_EM_RX_SIZE) &
             ~((uint16_t)0x00000080)) |
                ((uint16_t)bdaddrmatch << 7));
}

__INLINE uint8_t ble_nesn_err_getf(int elt_idx) {
  uint16_t localVal = EM_BLE_RD(BLE_RXSTAT_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);
  return ((localVal & ((uint16_t)0x00000040)) >> 6);
}

__INLINE void ble_nesn_err_setf(int elt_idx, uint8_t nesnerr) {
  ASSERT_ERR((((uint16_t)nesnerr << 6) & ~((uint16_t)0x00000040)) == 0);
  EM_BLE_WR(BLE_RXSTAT_ADDR + elt_idx * REG_BLE_EM_RX_SIZE,
            (EM_BLE_RD(BLE_RXSTAT_ADDR + elt_idx * REG_BLE_EM_RX_SIZE) &
             ~((uint16_t)0x00000040)) |
                ((uint16_t)nesnerr << 6));
}

__INLINE uint8_t ble_sn_err_getf(int elt_idx) {
  uint16_t localVal = EM_BLE_RD(BLE_RXSTAT_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);
  return ((localVal & ((uint16_t)0x00000020)) >> 5);
}

__INLINE void ble_sn_err_setf(int elt_idx, uint8_t snerr) {
  ASSERT_ERR((((uint16_t)snerr << 5) & ~((uint16_t)0x00000020)) == 0);
  EM_BLE_WR(BLE_RXSTAT_ADDR + elt_idx * REG_BLE_EM_RX_SIZE,
            (EM_BLE_RD(BLE_RXSTAT_ADDR + elt_idx * REG_BLE_EM_RX_SIZE) &
             ~((uint16_t)0x00000020)) |
                ((uint16_t)snerr << 5));
}

__INLINE uint8_t ble_mic_err_getf(int elt_idx) {
  uint16_t localVal = EM_BLE_RD(BLE_RXSTAT_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);
  return ((localVal & ((uint16_t)0x00000010)) >> 4);
}

__INLINE void ble_mic_err_setf(int elt_idx, uint8_t micerr) {
  ASSERT_ERR((((uint16_t)micerr << 4) & ~((uint16_t)0x00000010)) == 0);
  EM_BLE_WR(BLE_RXSTAT_ADDR + elt_idx * REG_BLE_EM_RX_SIZE,
            (EM_BLE_RD(BLE_RXSTAT_ADDR + elt_idx * REG_BLE_EM_RX_SIZE) &
             ~((uint16_t)0x00000010)) |
                ((uint16_t)micerr << 4));
}

__INLINE uint8_t ble_crc_err_getf(int elt_idx) {
  uint16_t localVal = EM_BLE_RD(BLE_RXSTAT_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);
  return ((localVal & ((uint16_t)0x00000008)) >> 3);
}

__INLINE void ble_crc_err_setf(int elt_idx, uint8_t crcerr) {
  ASSERT_ERR((((uint16_t)crcerr << 3) & ~((uint16_t)0x00000008)) == 0);
  EM_BLE_WR(BLE_RXSTAT_ADDR + elt_idx * REG_BLE_EM_RX_SIZE,
            (EM_BLE_RD(BLE_RXSTAT_ADDR + elt_idx * REG_BLE_EM_RX_SIZE) &
             ~((uint16_t)0x00000008)) |
                ((uint16_t)crcerr << 3));
}

__INLINE uint8_t ble_len_err_getf(int elt_idx) {
  uint16_t localVal = EM_BLE_RD(BLE_RXSTAT_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);
  return ((localVal & ((uint16_t)0x00000004)) >> 2);
}

__INLINE void ble_len_err_setf(int elt_idx, uint8_t lenerr) {
  ASSERT_ERR((((uint16_t)lenerr << 2) & ~((uint16_t)0x00000004)) == 0);
  EM_BLE_WR(BLE_RXSTAT_ADDR + elt_idx * REG_BLE_EM_RX_SIZE,
            (EM_BLE_RD(BLE_RXSTAT_ADDR + elt_idx * REG_BLE_EM_RX_SIZE) &
             ~((uint16_t)0x00000004)) |
                ((uint16_t)lenerr << 2));
}

__INLINE uint8_t ble_type_err_getf(int elt_idx) {
  uint16_t localVal = EM_BLE_RD(BLE_RXSTAT_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);
  return ((localVal & ((uint16_t)0x00000002)) >> 1);
}

__INLINE void ble_type_err_setf(int elt_idx, uint8_t typeerr) {
  ASSERT_ERR((((uint16_t)typeerr << 1) & ~((uint16_t)0x00000002)) == 0);
  EM_BLE_WR(BLE_RXSTAT_ADDR + elt_idx * REG_BLE_EM_RX_SIZE,
            (EM_BLE_RD(BLE_RXSTAT_ADDR + elt_idx * REG_BLE_EM_RX_SIZE) &
             ~((uint16_t)0x00000002)) |
                ((uint16_t)typeerr << 1));
}

__INLINE uint8_t ble_sync_err_getf(int elt_idx) {
  uint16_t localVal = EM_BLE_RD(BLE_RXSTAT_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);
  return ((localVal & ((uint16_t)0x00000001)) >> 0);
}

__INLINE void ble_sync_err_setf(int elt_idx, uint8_t syncerr) {
  ASSERT_ERR((((uint16_t)syncerr << 0) & ~((uint16_t)0x00000001)) == 0);
  EM_BLE_WR(BLE_RXSTAT_ADDR + elt_idx * REG_BLE_EM_RX_SIZE,
            (EM_BLE_RD(BLE_RXSTAT_ADDR + elt_idx * REG_BLE_EM_RX_SIZE) &
             ~((uint16_t)0x00000001)) |
                ((uint16_t)syncerr << 0));
}

/**
 * @brief RXPHCE register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  12:08                RXLEN   0x0
 *     04                 RXMD   0
 *     03                 RXSN   0
 *     02               RXNESN   0
 *  01:00               RXLLID   0x0
 * </pre>
 */
//#define BLE_RXPHCE_ADDR   (0x50008004 + jump_table_struct[offset_em_rx])
#define BLE_RXPHCE_ADDR (0x80004 + jump_table_struct[offset_em_rx])
#define BLE_RXPHCE_INDEX 0x00000002
#define BLE_RXPHCE_RESET 0x00000000

__INLINE uint16_t ble_rxphce_get(int elt_idx) {
  return EM_BLE_RD(BLE_RXPHCE_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);
}

__INLINE void ble_rxphce_set(int elt_idx, uint16_t value) {
  EM_BLE_WR(BLE_RXPHCE_ADDR + elt_idx * REG_BLE_EM_RX_SIZE, value);
}

// field definitions
#define BLE_RXLEN_MASK ((uint16_t)0x00001F00)
#define BLE_RXLEN_LSB 8
#define BLE_RXLEN_WIDTH ((uint16_t)0x00000005)
#define BLE_RXMD_BIT ((uint16_t)0x00000010)
#define BLE_RXMD_POS 4
#define BLE_RXSN_BIT ((uint16_t)0x00000008)
#define BLE_RXSN_POS 3
#define BLE_RXNESN_BIT ((uint16_t)0x00000004)
#define BLE_RXNESN_POS 2
#define BLE_RXLLID_MASK ((uint16_t)0x00000003)
#define BLE_RXLLID_LSB 0
#define BLE_RXLLID_WIDTH ((uint16_t)0x00000002)

#define BLE_RXLEN_RST 0x0
#define BLE_RXMD_RST 0x0
#define BLE_RXSN_RST 0x0
#define BLE_RXNESN_RST 0x0
#define BLE_RXLLID_RST 0x0

