kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_ble_em_rx.h
__INLINE void ble_rxphce_pack(int elt_idx, uint8_t rxlen, uint8_t rxmd,
                              uint8_t rxsn, uint8_t rxnesn, uint8_t rxllid) {
  ASSERT_ERR((((uint16_t)rxlen << 8) & ~((uint16_t)0x00001F00)) == 0);
  ASSERT_ERR((((uint16_t)rxmd << 4) & ~((uint16_t)0x00000010)) == 0);
  ASSERT_ERR((((uint16_t)rxsn << 3) & ~((uint16_t)0x00000008)) == 0);
  ASSERT_ERR((((uint16_t)rxnesn << 2) & ~((uint16_t)0x00000004)) == 0);
  ASSERT_ERR((((uint16_t)rxllid << 0) & ~((uint16_t)0x00000003)) == 0);
  EM_BLE_WR(BLE_RXPHCE_ADDR + elt_idx * REG_BLE_EM_RX_SIZE,
            ((uint16_t)rxlen << 8) | ((uint16_t)rxmd << 4) |
                ((uint16_t)rxsn << 3) | ((uint16_t)rxnesn << 2) |
                ((uint16_t)rxllid << 0));
}

__INLINE void ble_rxphce_unpack(int elt_idx, uint8_t* rxlen, uint8_t* rxmd,
                                uint8_t* rxsn, uint8_t* rxnesn,
                                uint8_t* rxllid) {
  uint16_t localVal = EM_BLE_RD(BLE_RXPHCE_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);

  *rxlen = (localVal & ((uint16_t)0x00001F00)) >> 8;
  *rxmd = (localVal & ((uint16_t)0x00000010)) >> 4;
  *rxsn = (localVal & ((uint16_t)0x00000008)) >> 3;
  *rxnesn = (localVal & ((uint16_t)0x00000004)) >> 2;
  *rxllid = (localVal & ((uint16_t)0x00000003)) >> 0;
}

__INLINE uint8_t ble_rxlen_getf(int elt_idx) {
  uint16_t localVal = EM_BLE_RD(BLE_RXPHCE_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);
  return ((localVal & ((uint16_t)0x00001F00)) >> 8);
}

__INLINE void ble_rxlen_setf(int elt_idx, uint8_t rxlen) {
  ASSERT_ERR((((uint16_t)rxlen << 8) & ~((uint16_t)0x00001F00)) == 0);
  EM_BLE_WR(BLE_RXPHCE_ADDR + elt_idx * REG_BLE_EM_RX_SIZE,
            (EM_BLE_RD(BLE_RXPHCE_ADDR + elt_idx * REG_BLE_EM_RX_SIZE) &
             ~((uint16_t)0x00001F00)) |
                ((uint16_t)rxlen << 8));
}

__INLINE uint8_t ble_rxmd_getf(int elt_idx) {
  uint16_t localVal = EM_BLE_RD(BLE_RXPHCE_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);
  return ((localVal & ((uint16_t)0x00000010)) >> 4);
}

__INLINE void ble_rxmd_setf(int elt_idx, uint8_t rxmd) {
  ASSERT_ERR((((uint16_t)rxmd << 4) & ~((uint16_t)0x00000010)) == 0);
  EM_BLE_WR(BLE_RXPHCE_ADDR + elt_idx * REG_BLE_EM_RX_SIZE,
            (EM_BLE_RD(BLE_RXPHCE_ADDR + elt_idx * REG_BLE_EM_RX_SIZE) &
             ~((uint16_t)0x00000010)) |
                ((uint16_t)rxmd << 4));
}

__INLINE uint8_t ble_rxsn_getf(int elt_idx) {
  uint16_t localVal = EM_BLE_RD(BLE_RXPHCE_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);
  return ((localVal & ((uint16_t)0x00000008)) >> 3);
}

__INLINE void ble_rxsn_setf(int elt_idx, uint8_t rxsn) {
  ASSERT_ERR((((uint16_t)rxsn << 3) & ~((uint16_t)0x00000008)) == 0);
  EM_BLE_WR(BLE_RXPHCE_ADDR + elt_idx * REG_BLE_EM_RX_SIZE,
            (EM_BLE_RD(BLE_RXPHCE_ADDR + elt_idx * REG_BLE_EM_RX_SIZE) &
             ~((uint16_t)0x00000008)) |
                ((uint16_t)rxsn << 3));
}

__INLINE uint8_t ble_rxnesn_getf(int elt_idx) {
  uint16_t localVal = EM_BLE_RD(BLE_RXPHCE_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);
  return ((localVal & ((uint16_t)0x00000004)) >> 2);
}

__INLINE void ble_rxnesn_setf(int elt_idx, uint8_t rxnesn) {
  ASSERT_ERR((((uint16_t)rxnesn << 2) & ~((uint16_t)0x00000004)) == 0);
  EM_BLE_WR(BLE_RXPHCE_ADDR + elt_idx * REG_BLE_EM_RX_SIZE,
            (EM_BLE_RD(BLE_RXPHCE_ADDR + elt_idx * REG_BLE_EM_RX_SIZE) &
             ~((uint16_t)0x00000004)) |
                ((uint16_t)rxnesn << 2));
}

__INLINE uint8_t ble_rxllid_getf(int elt_idx) {
  uint16_t localVal = EM_BLE_RD(BLE_RXPHCE_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);
  return ((localVal & ((uint16_t)0x00000003)) >> 0);
}

__INLINE void ble_rxllid_setf(int elt_idx, uint8_t rxllid) {
  ASSERT_ERR((((uint16_t)rxllid << 0) & ~((uint16_t)0x00000003)) == 0);
  EM_BLE_WR(BLE_RXPHCE_ADDR + elt_idx * REG_BLE_EM_RX_SIZE,
            (EM_BLE_RD(BLE_RXPHCE_ADDR + elt_idx * REG_BLE_EM_RX_SIZE) &
             ~((uint16_t)0x00000003)) |
                ((uint16_t)rxllid << 0));
}

/**
 * @brief RXPHADV register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  13:08             RXADVLEN   0x0
 *     07              RXRXADD   0
 *     06              RXTXADD   0
 *  03:00               RXTYPE   0x0
 * </pre>
 */
//#define BLE_RXPHADV_ADDR   (0x50008004 + jump_table_struct[offset_em_rx])
#define BLE_RXPHADV_ADDR (0x80004 + jump_table_struct[offset_em_rx])
#define BLE_RXPHADV_INDEX 0x00000002
#define BLE_RXPHADV_RESET 0x00000000

__INLINE uint16_t ble_rxphadv_get(int elt_idx) {
  return EM_BLE_RD(BLE_RXPHADV_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);
}

__INLINE void ble_rxphadv_set(int elt_idx, uint16_t value) {
  EM_BLE_WR(BLE_RXPHADV_ADDR + elt_idx * REG_BLE_EM_RX_SIZE, value);
}

// field definitions
#define BLE_RXADVLEN_MASK ((uint16_t)0x00003F00)
#define BLE_RXADVLEN_LSB 8
#define BLE_RXADVLEN_WIDTH ((uint16_t)0x00000006)
#define BLE_RXRXADD_BIT ((uint16_t)0x00000080)
#define BLE_RXRXADD_POS 7
#define BLE_RXTXADD_BIT ((uint16_t)0x00000040)
#define BLE_RXTXADD_POS 6
#define BLE_RXTYPE_MASK ((uint16_t)0x0000000F)
#define BLE_RXTYPE_LSB 0
#define BLE_RXTYPE_WIDTH ((uint16_t)0x00000004)

#define BLE_RXADVLEN_RST 0x0
#define BLE_RXRXADD_RST 0x0
#define BLE_RXTXADD_RST 0x0
#define BLE_RXTYPE_RST 0x0

__INLINE void ble_rxphadv_pack(int elt_idx, uint8_t rxadvlen, uint8_t rxrxadd,
                               uint8_t rxtxadd, uint8_t rxtype) {
  ASSERT_ERR((((uint16_t)rxadvlen << 8) & ~((uint16_t)0x00003F00)) == 0);
  ASSERT_ERR((((uint16_t)rxrxadd << 7) & ~((uint16_t)0x00000080)) == 0);
  ASSERT_ERR((((uint16_t)rxtxadd << 6) & ~((uint16_t)0x00000040)) == 0);
  ASSERT_ERR((((uint16_t)rxtype << 0) & ~((uint16_t)0x0000000F)) == 0);
  EM_BLE_WR(BLE_RXPHADV_ADDR + elt_idx * REG_BLE_EM_RX_SIZE,
            ((uint16_t)rxadvlen << 8) | ((uint16_t)rxrxadd << 7) |
                ((uint16_t)rxtxadd << 6) | ((uint16_t)rxtype << 0));
}

__INLINE void ble_rxphadv_unpack(int elt_idx, uint8_t* rxadvlen,
                                 uint8_t* rxrxadd, uint8_t* rxtxadd,
                                 uint8_t* rxtype) {
  uint16_t localVal =
      EM_BLE_RD(BLE_RXPHADV_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);

  *rxadvlen = (localVal & ((uint16_t)0x00003F00)) >> 8;
  *rxrxadd = (localVal & ((uint16_t)0x00000080)) >> 7;
  *rxtxadd = (localVal & ((uint16_t)0x00000040)) >> 6;
  *rxtype = (localVal & ((uint16_t)0x0000000F)) >> 0;
}

__INLINE uint8_t ble_rxadvlen_getf(int elt_idx) {
  uint16_t localVal =
      EM_BLE_RD(BLE_RXPHADV_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);
  return ((localVal & ((uint16_t)0x00003F00)) >> 8);
}

