kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_ble_em_rx.h
__INLINE void ble_rxadvlen_setf(int elt_idx, uint8_t rxadvlen) {
  ASSERT_ERR((((uint16_t)rxadvlen << 8) & ~((uint16_t)0x00003F00)) == 0);
  EM_BLE_WR(BLE_RXPHADV_ADDR + elt_idx * REG_BLE_EM_RX_SIZE,
            (EM_BLE_RD(BLE_RXPHADV_ADDR + elt_idx * REG_BLE_EM_RX_SIZE) &
             ~((uint16_t)0x00003F00)) |
                ((uint16_t)rxadvlen << 8));
}

__INLINE uint8_t ble_rxrxadd_getf(int elt_idx) {
  uint16_t localVal =
      EM_BLE_RD(BLE_RXPHADV_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);
  return ((localVal & ((uint16_t)0x00000080)) >> 7);
}

__INLINE void ble_rxrxadd_setf(int elt_idx, uint8_t rxrxadd) {
  ASSERT_ERR((((uint16_t)rxrxadd << 7) & ~((uint16_t)0x00000080)) == 0);
  EM_BLE_WR(BLE_RXPHADV_ADDR + elt_idx * REG_BLE_EM_RX_SIZE,
            (EM_BLE_RD(BLE_RXPHADV_ADDR + elt_idx * REG_BLE_EM_RX_SIZE) &
             ~((uint16_t)0x00000080)) |
                ((uint16_t)rxrxadd << 7));
}

__INLINE uint8_t ble_rxtxadd_getf(int elt_idx) {
  uint16_t localVal =
      EM_BLE_RD(BLE_RXPHADV_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);
  return ((localVal & ((uint16_t)0x00000040)) >> 6);
}

__INLINE void ble_rxtxadd_setf(int elt_idx, uint8_t rxtxadd) {
  ASSERT_ERR((((uint16_t)rxtxadd << 6) & ~((uint16_t)0x00000040)) == 0);
  EM_BLE_WR(BLE_RXPHADV_ADDR + elt_idx * REG_BLE_EM_RX_SIZE,
            (EM_BLE_RD(BLE_RXPHADV_ADDR + elt_idx * REG_BLE_EM_RX_SIZE) &
             ~((uint16_t)0x00000040)) |
                ((uint16_t)rxtxadd << 6));
}

__INLINE uint8_t ble_rxtype_getf(int elt_idx) {
  uint16_t localVal =
      EM_BLE_RD(BLE_RXPHADV_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);
  return ((localVal & ((uint16_t)0x0000000F)) >> 0);
}

__INLINE void ble_rxtype_setf(int elt_idx, uint8_t rxtype) {
  ASSERT_ERR((((uint16_t)rxtype << 0) & ~((uint16_t)0x0000000F)) == 0);
  EM_BLE_WR(BLE_RXPHADV_ADDR + elt_idx * REG_BLE_EM_RX_SIZE,
            (EM_BLE_RD(BLE_RXPHADV_ADDR + elt_idx * REG_BLE_EM_RX_SIZE) &
             ~((uint16_t)0x0000000F)) |
                ((uint16_t)rxtype << 0));
}

/**
 * @brief RXCHASS register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  13:08          USED_CH_IDX   0x0
 *  07:00                 RSSI   0x0
 * </pre>
 */
//#define BLE_RXCHASS_ADDR   (0x50008006 + jump_table_struct[offset_em_rx])
#define BLE_RXCHASS_ADDR (0x80006 + jump_table_struct[offset_em_rx])
#define BLE_RXCHASS_INDEX 0x00000003
#define BLE_RXCHASS_RESET 0x00000000

__INLINE uint16_t ble_rxchass_get(int elt_idx) {
  return EM_BLE_RD(BLE_RXCHASS_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);
}

__INLINE void ble_rxchass_set(int elt_idx, uint16_t value) {
  EM_BLE_WR(BLE_RXCHASS_ADDR + elt_idx * REG_BLE_EM_RX_SIZE, value);
}

// field definitions
#define BLE_USED_CH_IDX_MASK ((uint16_t)0x00003F00)
#define BLE_USED_CH_IDX_LSB 8
#define BLE_USED_CH_IDX_WIDTH ((uint16_t)0x00000006)
#define BLE_RSSI_MASK ((uint16_t)0x000000FF)
#define BLE_RSSI_LSB 0
#define BLE_RSSI_WIDTH ((uint16_t)0x00000008)

#define BLE_USED_CH_IDX_RST 0x0
#define BLE_RSSI_RST 0x0

__INLINE void ble_rxchass_pack(int elt_idx, uint8_t usedchidx, uint8_t rssi) {
  ASSERT_ERR((((uint16_t)usedchidx << 8) & ~((uint16_t)0x00003F00)) == 0);
  ASSERT_ERR((((uint16_t)rssi << 0) & ~((uint16_t)0x000000FF)) == 0);
  EM_BLE_WR(BLE_RXCHASS_ADDR + elt_idx * REG_BLE_EM_RX_SIZE,
            ((uint16_t)usedchidx << 8) | ((uint16_t)rssi << 0));
}

__INLINE void ble_rxchass_unpack(int elt_idx, uint8_t* usedchidx,
                                 uint8_t* rssi) {
  uint16_t localVal =
      EM_BLE_RD(BLE_RXCHASS_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);

  *usedchidx = (localVal & ((uint16_t)0x00003F00)) >> 8;
  *rssi = (localVal & ((uint16_t)0x000000FF)) >> 0;
}

__INLINE uint8_t ble_used_ch_idx_getf(int elt_idx) {
  uint16_t localVal =
      EM_BLE_RD(BLE_RXCHASS_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);
  return ((localVal & ((uint16_t)0x00003F00)) >> 8);
}

__INLINE void ble_used_ch_idx_setf(int elt_idx, uint8_t usedchidx) {
  ASSERT_ERR((((uint16_t)usedchidx << 8) & ~((uint16_t)0x00003F00)) == 0);
  EM_BLE_WR(BLE_RXCHASS_ADDR + elt_idx * REG_BLE_EM_RX_SIZE,
            (EM_BLE_RD(BLE_RXCHASS_ADDR + elt_idx * REG_BLE_EM_RX_SIZE) &
             ~((uint16_t)0x00003F00)) |
                ((uint16_t)usedchidx << 8));
}

__INLINE uint8_t ble_rssi_getf(int elt_idx) {
  uint16_t localVal =
      EM_BLE_RD(BLE_RXCHASS_ADDR + elt_idx * REG_BLE_EM_RX_SIZE);
  return ((localVal & ((uint16_t)0x000000FF)) >> 0);
}

__INLINE void ble_rssi_setf(int elt_idx, uint8_t rssi) {
  ASSERT_ERR((((uint16_t)rssi << 0) & ~((uint16_t)0x000000FF)) == 0);
  EM_BLE_WR(BLE_RXCHASS_ADDR + elt_idx * REG_BLE_EM_RX_SIZE,
            (EM_BLE_RD(BLE_RXCHASS_ADDR + elt_idx * REG_BLE_EM_RX_SIZE) &
             ~((uint16_t)0x000000FF)) |
                ((uint16_t)rssi << 0));
}

/**
 * @brief RXBUF register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:00                RXBUF   0x0
 * </pre>
 */
//#define BLE_RXBUF_ADDR   (0x50008008 + jump_table_struct[offset_em_rx])
#define BLE_RXBUF_ADDR (0x80008 + jump_table_struct[offset_em_rx])
#define BLE_RXBUF_INDEX 0x00000004
#define BLE_RXBUF_RESET 0x00000000
#define BLE_RXBUF_COUNT 19

__INLINE uint16_t ble_rxbuf_get(int elt_idx, int reg_idx) {
  ASSERT_ERR(reg_idx <= 18);
  return EM_BLE_RD(BLE_RXBUF_ADDR + elt_idx * REG_BLE_EM_RX_SIZE + reg_idx * 2);
}

__INLINE void ble_rxbuf_set(int elt_idx, int reg_idx, uint16_t value) {
  ASSERT_ERR(reg_idx <= 18);
  EM_BLE_WR(BLE_RXBUF_ADDR + elt_idx * REG_BLE_EM_RX_SIZE + reg_idx * 2, value);
}

// field definitions
#define BLE_RXBUF_MASK ((uint16_t)0x0000FFFF)
#define BLE_RXBUF_LSB 0
#define BLE_RXBUF_WIDTH ((uint16_t)0x00000010)

#define BLE_RXBUF_RST 0x0

__INLINE uint16_t ble_rxbuf_getf(int elt_idx, int reg_idx) {
  ASSERT_ERR(reg_idx <= 18);
  uint16_t localVal =
      EM_BLE_RD(BLE_RXBUF_ADDR + elt_idx * REG_BLE_EM_RX_SIZE + reg_idx * 2);
  ASSERT_ERR((localVal & ~((uint16_t)0x0000FFFF)) == 0);
  return (localVal >> 0);
}

__INLINE void ble_rxbuf_setf(int elt_idx, int reg_idx, uint16_t rxbuf) {
  ASSERT_ERR(reg_idx <= 18);
  ASSERT_ERR((((uint16_t)rxbuf << 0) & ~((uint16_t)0x0000FFFF)) == 0);
  EM_BLE_WR(BLE_RXBUF_ADDR + elt_idx * REG_BLE_EM_RX_SIZE + reg_idx * 2,
            (uint16_t)rxbuf << 0);
}

#endif  // _REG_BLE_EM_RX_H_
